# TableViewUIUtils Methods

---
The TableViewUIUtils type exposes the following members.
| Name| Description
---|---|---
| TestCellAndPromptToEditTypeParameter|  Prompts the end-user to control whether a type parameter contained in the specified table cell should be allowed edited.
Top
#### Reference
TableViewUIUtils Class
Autodesk.Revit.UI Namespace